Autodesk.Revit.DB.AnnotationCleanupOptions.GetAnnotationCategoriesFromElements(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetAnnotationCategoriesInView(Autodesk.Revit.DB.View)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetIgnoreHalftone(System.Boolean)
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetIgnoreHalftone
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetIgnoreCutPatterns(System.Boolean)
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetIgnoreCutPatterns
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetIgnoreSurfacePatterns(System.Boolean)
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetIgnoreSurfacePatterns
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetCategoryIdsToCleanupMap(Autodesk.Revit.DB.View,System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,System.Boolean})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetCategoryIdsToCleanupMapWithScope(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetCategoryIdsToCleanupMap(Autodesk.Revit.DB.View)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetCategoryIdsToIgnoreForOverlap(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetCategoryIdsToIgnoreForOverlap
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetPythonPath(System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetPythonPath
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetBasedirPath(System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetBasedirPath
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetZoomedPixelLength(System.Int32)
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetZoomedPixelLength
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.SetPpiOnSheet(System.Int32)
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.GetPpiOnSheet
Since:
2027

Autodesk.Revit.DB.AnnotationCleanupOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AnnotationCleanupOptions
AnnotationCleanupOptions
Since:
2027